/*
 * @Author: ouyangdecai 
 * @Date: 2017-12-01 09:03:01 
 * @Description: 一级地图mock数据
 * @Last Modified by: ouyangdecai
 * @Last Modified time: 2017-12-13 18:02:16
 */
export default {
    url: '/jiulongpo/map/:caseId/:areaId/:startTime/:endTime',
    mock: {
        'code': 1,
        'msg': 'success',
        'result':[
            {
                'id': '500107730000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107620000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107640000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107790000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107780000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107P30000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107630000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107690000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107800000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107P10000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107P20000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107720000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107700000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107710000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107770000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107740000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107610000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107760000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107680000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '500107810000',
                'value': '@integer(1000,9999)'
            }, {
                'id': '8b133fa0b00c4c53aced74abe5cac2',
                'value': '@integer(1000,9999)'
            }
            
        ]
        // result: [
        //     {
        //     'id': '500107P30000',
        //     'value': 8,
        //     'mc': '二郎派出所'
        //     },
        //     {
        //     'id': '500107700000',
        //     'value': 20,
        //     'mc': '华岩派出所'
        //     },
        //     {
        //     'id': '500107760000',
        //     'value': 6,
        //     'mc': '含谷派出所'
        //     },
        //     {
        //     'id': '500107780000',
        //     'value': 1,
        //     'mc': '走马派出所'
        //     },
        //     {
        //     'id': '500107630000',
        //     'value': 15,
        //     'mc': '谢家湾派出所'
        //     },
        //     {
        //     'id': '500107P10000',
        //     'value': 24,
        //     'mc': '石桥铺派出所'
        //     },
        //     {
        //     'id': '500107740000',
        //     'value': 12,
        //     'mc': '白市驿派出所'
        //     },
        //     {
        //     'id': '500107690000',
        //     'value': 9,
        //     'mc': '九龙派出所'
        //     },
        //     {
        //     'id': '500107640000',
        //     'value': 8,
        //     'mc': '石坪桥派出所'
        //     },
        //     {
        //     'id': '500107620000',
        //     'value': 30,
        //     'mc': '杨家坪派出所'
        //     },
        //     {
        //     'id': '500107P20000',
        //     'value': 38,
        //     'mc': '歇台子派出所'
        //     },
        //     {
        //     'id': '500107610000',
        //     'value': 7,
        //     'mc': '黄桷坪派出所'
        //     },
        //     {
        //     'id': '500107680000',
        //     'value': 8,
        //     'mc': '中梁山派出所'
        //     },
        //     {
        //     'id': '500107720000',
        //     'value': 2,
        //     'mc': '铜罐驿派出所'
        //     },
        //     {
        //     'id': '500107710000',
        //     'value': 7,
        //     'mc': '西彭派出所'
        //     },
        //     {
        //     'id': '500107810000',
        //     'value': 17,
        //     'mc': '九龙园派出所'
        //     },
        //     {
        //     'id': '500107770000',
        //     'value': 2,
        //     'mc': '金凤派出所'
        //     },
        //     {
        //     'id': '500107790000',
        //     'value': 4,
        //     'mc': '巴福派出所'
        //     },
        //     {
        //     'id': '500107800000',
        //     'value': 0,
        //     'mc': '石板派出所'
        //     },
        //     {
        //     'id': '500107580000',
        //     'value': 0,
        //     'mc': '兴胜路派出所'
        //     },
        //     {
        //     'id': '500107750000',
        //     'value': 0,
        //     'mc': '白市驿机场治安派出所'
        //     },
        //     {
        //     'id': '500107590000',
        //     'value': 0,
        //     'mc': '黄桷派出所'
        //     },
        //     {
        //     'id': '500107730000',
        //     'value': 0,
        //     'mc': '陶家派出所'
        //     }
        // ]
    }
}